4ms/metamodule/firmware/lib/stm32-usb-host-lib/Core/Src/usbh_core.c
    case HOST_DEV_ATTACHED_WAITSPEED:
    	/* todo: переделать - сперва ждём, потом проверяем скорость */
    	if (USBH_LL_GetSpeedReady(phost))
    	{
            /* Wait for 100 ms after Reset */
    		USBH_ProcessDelay(phost, HOST_DEV_ATTACHED, 100);

    	      phost->rootTarget.speed = (uint8_t)USBH_LL_GetSpeed(phost);
    	      phost->rootTarget.tt_hubaddr = HOSTDEV_DEFAULT_HUBADDR;
    	      phost->rootTarget.tt_prtaddr = HOSTDEV_DEFAULT_PRTADDR;
    	}
 		break;

 	// С этого состояния начинается повторная енуменация для устройств на HUB
   case HOST_DEV_ATTACHED :

      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_CONNECTION);
      }

      phost->gState = HOST_ENUMERATION;

      phost->Control.pipe_out = USBH_AllocPipe(phost, 0x00U);
      phost->Control.pipe_in  = USBH_AllocPipe(phost, 0x80U);


      /* Open Control pipes */
      USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
    		  	  	  	  phost->currentTarget,
                          USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

      /* Open Control pipes */
      USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
    		  	  	  	  phost->currentTarget,
                          USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      break;

    case HOST_ENUMERATION:
      /* Check for enumeration status */
      status = USBH_HandleEnum(phost);
      if (status == USBH_OK)
      {
        /* The function shall return USBH_OK when full enumeration is complete */
        USBH_UsrLog("Enumeration done.");

        phost->device.current_interface = 0U;

        if (phost->device.DevDesc.bNumConfigurations == 1U)
        {
          USBH_UsrLog("This device has only 1 configuration.");
          phost->gState = HOST_SET_CONFIGURATION;
        }
        else
        {
            USBH_UsrLog("This device has %u configuration. Need selection.", (unsigned) phost->device.DevDesc.bNumConfigurations);
          phost->gState = HOST_INPUT;
        }
#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
      break;

    case HOST_INPUT:
    {
      /* user callback for end of device basic enumeration */
      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
        phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
    }
    break;

    case HOST_SET_CONFIGURATION:
      /* set configuration */
      if (USBH_SetCfg(phost, (uint16_t)phost->device.CfgDesc.bConfigurationValue) == USBH_OK)
      {
        phost->gState = HOST_SET_WAKEUP_FEATURE;
        USBH_UsrLog("Default configuration %02X set.", (unsigned) phost->device.CfgDesc.bConfigurationValue);
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      break;

    case  HOST_SET_WAKEUP_FEATURE:

      if (((phost->device.CfgDesc.bmAttributes) & (1U << 5)) != 0U)
      {
        status = USBH_SetFeature(phost, FEATURE_SELECTOR_REMOTEWAKEUP);

        if (status == USBH_OK)
        {
          USBH_UsrLog("Device remote wakeup enabled");
          phost->gState = HOST_CHECK_CLASS;
        }
        else if (status == USBH_NOT_SUPPORTED)
        {
          USBH_UsrLog("Remote wakeup not supported by the device");
          phost->gState = HOST_CHECK_CLASS;
        }
        else
        {
          /* .. */
        }
      }
      else
      {
        phost->gState = HOST_CHECK_CLASS;
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      break;

    case HOST_CHECK_CLASS:

        //USBH_UsrLog("HOST_CHECK_CLASS: Incoming class: %02X.", (unsigned) phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass);
      	//printhex(0x00, & phost->device.CfgDesc.Itf_Desc[0], sizeof phost->device.CfgDesc.Itf_Desc[0]);
      	//printhex(0x00, & phost->device.CfgDesc_Raw, sizeof phost->device.CfgDesc_Raw);

      if (phost->ClassNumber == 0U)
      {
        USBH_UsrLog("No Class has been registered.");
        phost->gState = HOST_ABORT_STATE;
      }
      else
      {
          USBH_UsrLog("Total %d classes has been registered.", (int) phost->ClassNumber);
       phost->pActiveClass = NULL;

        for (idx = 0U; idx < phost->ClassNumber; idx++)
        {
        	/* выключаем из рассмотрения HUB CLASS, если он уже один раз сработал */
			//turn off HUB CLASS from consideration if it has already worked once
          if (phost->hubInstances != 0 && phost->pClass[idx] == &HUB_Class)
          {
        	  continue;
          }

          if (phost->pClass[idx]->ClassCode == phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass)
          {
            phost->pActiveClass = phost->pClass[idx];
            break;
          }
        }

        if (phost->pActiveClass != NULL)
        {
        	USBH_StatusTypeDef st = phost->pActiveClass->Init(phost, phost->currentTarget);
          if (st == USBH_OK)
          {
            phost->gState = HOST_CLASS_REQUEST;
            USBH_UsrLog("%s class code %02X started.", phost->pActiveClass->Name, (unsigned) phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass);

